micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_rcc_ex.c
/**
  ******************************************************************************
  * @file    stm32n6xx_hal_rcc_ex.c
  * @author  MCD Application Team
  * @brief   Extended RCC HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities RCC extension peripheral:
  *           + Extended Peripheral Control functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file in
  * the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32n6xx_hal.h"

/** @addtogroup STM32N6xx_HAL_Driver
  * @{
  */

/** @defgroup RCCEx  RCCEx
  * @brief RCC HAL module driver
  * @{
  */

#ifdef HAL_RCC_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private defines -----------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/** @defgroup RCCEx_Private_Functions_Prototypes RCCEx Private Functions Prototypes
  * @{
  */
static uint32_t RCCEx_GetHCLKFreq(uint32_t SYSCLK_Frequency);
static uint32_t RCCEx_GetPCLK1Freq(uint32_t HCLK_Frequency);
static uint32_t RCCEx_GetPCLK2Freq(uint32_t PCLK_Frequency);
static uint32_t RCCEx_GetPCLK4Freq(uint32_t PCLK_Frequency);
static uint32_t RCCEx_GetPCLK5Freq(uint32_t PCLK_Frequency);
static uint32_t RCCEx_GetPLLSourceFreq(uint32_t PLLsource);
static uint32_t RCCEx_CalcPLLFreq(uint32_t PLLInputFreq, uint32_t M, uint32_t N,
                                  uint32_t FRACN, uint32_t P1, uint32_t P2);
static uint32_t RCCEx_GetADCCLKFreq(uint32_t ADCxSource);
static uint32_t RCCEx_GetADFCLKFreq(uint32_t ADFxSource);
static uint32_t RCCEx_GetCLKPCLKFreq(uint32_t CLKPxSource);
static uint32_t RCCEx_GetCSICLKFreq(void);
static uint32_t RCCEx_GetDCMIPPCLKFreq(uint32_t DCMIPPxSource);
static uint32_t RCCEx_GetETH1CLKFreq(uint32_t ETH1xSource);
static uint32_t RCCEx_GetETH1PTPCLKFreq(uint32_t ETH1PTPxSource);
static uint32_t RCCEx_GetFDCANCLKFreq(uint32_t FDCANxSource);
static uint32_t RCCEx_GetFMCCLKFreq(uint32_t FMCxSource);
static uint32_t RCCEx_GetI2CCLKFreq(uint32_t I2CxSource);
static uint32_t RCCEx_GetI3CCLKFreq(uint32_t I3CxSource);
static uint32_t RCCEx_GetLPTIMCLKFreq(uint32_t LPTIMxSource);
static uint32_t RCCEx_GetLPUARTCLKFreq(uint32_t LPUARTxSource);
static uint32_t RCCEx_GetLTDCCLKFreq(uint32_t LPTIMxSource);
static uint32_t RCCEx_GetMDFCLKFreq(uint32_t MDFxSource);
static uint32_t RCCEx_GetPSSICLKFreq(uint32_t PSSIxSource);
static uint32_t RCCEx_GetRTCCLKFreq(void);
static uint32_t RCCEx_GetSAICLKFreq(uint32_t SAIxSource);
static uint32_t RCCEx_GetSDMMCCLKFreq(uint32_t SDMMCxSource);
static uint32_t RCCEx_GetSPDIFRXCLKFreq(uint32_t SPDIFRXxSource);
static uint32_t RCCEx_GetSPICLKFreq(uint32_t SPIxSource);
static uint32_t RCCEx_GetUARTCLKFreq(uint32_t UARTxSource);
static uint32_t RCCEx_GetUSARTCLKFreq(uint32_t USARTxSource);
static uint32_t RCCEx_GetOTGPHYCLKFreq(uint32_t OTGPHYxSource);
static uint32_t RCCEx_GetOTGPHYCKREFCLKFreq(uint32_t OTGPHYxCKREFSource);
static uint32_t RCCEx_GetXSPICLKFreq(uint32_t XSPIxSource);
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Functions RCCEx Exported Functions
  * @{
  */

/** @defgroup RCCEx_Exported_Functions_Group1 Extended Peripheral Control functions
  *  @brief  Extended Peripheral Control functions
  *
@verbatim
 ===============================================================================
                ##### Extended Peripheral Control functions  #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the RCC Clocks
    frequencies.
    [..]
    (@) Important note: Care must be taken when HAL_RCCEx_PeriphCLKConfig() is used to
        select the RTC clock source; in this case the Backup domain will be reset in
        order to modify the RTC Clock source, as consequence RTC registers (including
        the backup registers) and RCC_BDCR register are set to their reset values.

@endverbatim
  * @{
  */
/**
  * @brief  Initializes the RCC extended peripherals clocks according to the specified
  *         parameters in the RCC_PeriphCLKInitTypeDef.
  * @param  PeriphClkInit: pointer to an RCC_PeriphCLKInitTypeDef structure that
  *         contains the configuration information for the Extended Peripherals clocks
  *         (ADC, ADF1, CKPER, DCMI, DCMIPP, FDCAN, FMC, I2C1, I2C2, I2C3, I2C4, I3C1, I3C2,
  *         LPTIM1, LPTIM2, LPTIM3, LPTIM4, LPTIM5, LTDC, LPUART1, MDF1, PSSI, RTC, SAI1, SAI2,
  *         SDMMC1, SDMMC2, SPDIFRX1, SPI1, SPI2, SPI3, SPI4, SPI5, SPI6, TIM,
  *         USART1, USART2, USART3, UART4, UART5, USART6, UART7, UART8, UART9, USART10,
  *         USBPHY1, USBPHY2, USB OTGHS1, USB OTGHS2, XSPI1, XSPI2, XSPI3).
  * @note   Care must be taken when HAL_RCCEx_PeriphCLKConfig() is used to select
  *         the RTC clock source; in this case the Backup domain will be reset in
  *         order to modify the RTC Clock source, as consequence RTC registers (including
  *         the backup registers) are set to their reset values.
  * @note   Dynamic switches are used for peripheral input clock selection meaning the switch setting
  *         can only be changed if both input clocks are present during transition time.
  * @note   Care must be taken when RCC_PPPCLKSOURCE_ICx is selected. The ICx ClockSelection and ClockDivider fields
  *         modification indeed impacts all peripherals using this ICx as clock source.
  *
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RCCEx_PeriphCLKConfig(const RCC_PeriphCLKInitTypeDef  *PeriphClkInit)
{
  uint32_t tmpreg;
  uint32_t tickstart;
  HAL_StatusTypeDef ret = HAL_OK;      /* Intermediate status */
  HAL_StatusTypeDef status = HAL_OK;   /* Final status */

  /* Check the parameters */
  assert_param(IS_RCC_PERIPHCLOCK(PeriphClkInit->PeriphClockSelection));

  /*---------------------------- RTC configuration -------------------------------*/
  if ((PeriphClkInit->PeriphClockSelection & RCC_PERIPHCLK_RTC) == RCC_PERIPHCLK_RTC)
  {
    /* check for RTC Parameters used to output RTCCLK */
    assert_param(IS_RCC_RTCCLKSOURCE(PeriphClkInit->RTCClockSelection));

    /* As the RTC clock source selection can be changed only if the Backup Domain is reset */
    /* reset the Backup domain only if the RTC Clock source selection is modified from default reset value */
    tmpreg = LL_RCC_GetRTCClockSource();

    if ((tmpreg != RCC_RTCCLKSOURCE_DISABLE) && (tmpreg != (PeriphClkInit->RTCClockSelection & RCC_CCIPR7_RTCSEL)))
    {
      /* Enable write access to Backup domain */
      SET_BIT(PWR->DBPCR, PWR_DBPCR_DBP);

      /* Read back to check Backup domain enabled */
      if (READ_BIT(PWR->DBPCR, PWR_DBPCR_DBP) == 0U)
      {
        ret = HAL_ERROR;
      }
      else
      {
#if 0 /* TO DO */
        /* Store the content of BDCR register before the reset of Backup Domain */
        /* excepted the RTC clock source selection that will be changed */
        tmpreg = READ_BIT(RCC->BDCR, ~(RCC_BDCR_RTCSEL));
        __HAL_RCC_BACKUPRESET_FORCE();
        __HAL_RCC_BACKUPRESET_RELEASE();
        /* Restore the content of BDCR register */
        WRITE_REG(RCC->BDCR, tmpreg);
#endif /* #if 0  TO DO */
      }
    }

