micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_rcc_ex.c
  /* Get the ADC clock source ------------------------------------------------*/
  PeriphClkInit->AdcClockSelection          = __HAL_RCC_GET_ADC_SOURCE();
  /* Get the ADC divider ------------------------------------------------*/
  PeriphClkInit->AdcDivider                 = __HAL_RCC_GET_ADC_DIVIDER();
  /* Get the ADF1 clock source -----------------------------------------------*/
  PeriphClkInit->Adf1ClockSelection         = __HAL_RCC_GET_ADF1_SOURCE();
  /* Get the CKPER clock source ----------------------------------------------*/
  PeriphClkInit->CkperClockSelection        = __HAL_RCC_GET_CLKP_SOURCE();
  /* Get the DCMIPP clock source ---------------------------------------------*/
  PeriphClkInit->DcmippClockSelection       = __HAL_RCC_GET_DCMIPP_SOURCE();
  /* Get the ETH1 clock source -----------------------------------------------*/
  PeriphClkInit->Eth1ClockSelection         = __HAL_RCC_GET_ETH1_SOURCE();
  /* Get the ETH1 PHY interface ----------------------------------------------*/
  PeriphClkInit->Eth1PhyInterfaceSelection  = __HAL_RCC_GET_ETH1PHY_INTERFACE();
  /* Get the ETH1 RX clock source --------------------------------------------*/
  PeriphClkInit->Eth1RxClockSelection       = __HAL_RCC_GET_ETH1RX_SOURCE();
  /* Get the ETH1 TX clock source --------------------------------------------*/
  PeriphClkInit->Eth1TxClockSelection       = __HAL_RCC_GET_ETH1TX_SOURCE();
  /* Get the ETH1 PTP clock source -------------------------------------------*/
  PeriphClkInit->Eth1PtpClockSelection      = __HAL_RCC_GET_ETH1PTP_SOURCE();
  /* Get the ETH1 PTP divider ------------------------------------------------*/
  PeriphClkInit->Eth1PtpDivider             = __HAL_RCC_GET_ETH1PTP_DIVIDER();
  /* Get the FDCAN kernel clock source ---------------------------------------*/
  PeriphClkInit->FdcanClockSelection        = __HAL_RCC_GET_FDCAN_SOURCE();
  /* Get the FMC kernel clock source -----------------------------------------*/
  PeriphClkInit->FmcClockSelection          = __HAL_RCC_GET_FMC_SOURCE();
  /* Get the I2C1 clock source -----------------------------------------------*/
  PeriphClkInit->I2c1ClockSelection         = __HAL_RCC_GET_I2C1_SOURCE();
  /* Get the I2C2 clock source -----------------------------------------------*/
  PeriphClkInit->I2c2ClockSelection         = __HAL_RCC_GET_I2C2_SOURCE();
  /* Get the I2C3 clock source -----------------------------------------------*/
  PeriphClkInit->I2c3ClockSelection         = __HAL_RCC_GET_I2C3_SOURCE();
  /* Get the I2C4 clock source -----------------------------------------------*/
  PeriphClkInit->I2c4ClockSelection         = __HAL_RCC_GET_I2C4_SOURCE();
  /* Get the I3C1 clock source -----------------------------------------------*/
  PeriphClkInit->I3c1ClockSelection         = __HAL_RCC_GET_I3C1_SOURCE();
  /* Get the I3C2 clock source -----------------------------------------------*/
  PeriphClkInit->I3c2ClockSelection         = __HAL_RCC_GET_I3C2_SOURCE();
  /* Get the LPTIM1 clock source ---------------------------------------------*/
  PeriphClkInit->Lptim1ClockSelection       = __HAL_RCC_GET_LPTIM1_SOURCE();
  /* Get the LPTIM2 clock source ---------------------------------------------*/
  PeriphClkInit->Lptim2ClockSelection       = __HAL_RCC_GET_LPTIM2_SOURCE();
  /* Get the LPTIM3 clock source ---------------------------------------------*/
  PeriphClkInit->Lptim3ClockSelection       = __HAL_RCC_GET_LPTIM3_SOURCE();
  /* Get the LPTIM4 clock source ---------------------------------------------*/
  PeriphClkInit->Lptim4ClockSelection       = __HAL_RCC_GET_LPTIM4_SOURCE();
  /* Get the LPTIM5 clock source ---------------------------------------------*/
  PeriphClkInit->Lptim5ClockSelection       = __HAL_RCC_GET_LPTIM5_SOURCE();
  /* Get the LPUART1 clock source --------------------------------------------*/
  PeriphClkInit->Lpuart1ClockSelection      = __HAL_RCC_GET_LPUART1_SOURCE();
  /* Get the LTDC clock source -----------------------------------------------*/
  PeriphClkInit->LtdcClockSelection         = __HAL_RCC_GET_LTDC_SOURCE();
  /* Get the MDF1 clock source -----------------------------------------------*/
  PeriphClkInit->Mdf1ClockSelection         = __HAL_RCC_GET_MDF1_SOURCE();
  /* Get the PSSI clock source -----------------------------------------------*/
  PeriphClkInit->PssiClockSelection         = __HAL_RCC_GET_PSSI_SOURCE();
  /* Get the RTC clock source ------------------------------------------------*/
  PeriphClkInit->RTCClockSelection          = __HAL_RCC_GET_RTC_SOURCE();
  /* Get the SAI1 clock source -----------------------------------------------*/
  PeriphClkInit->Sai1ClockSelection         = __HAL_RCC_GET_SAI1_SOURCE();
  /* Get the SAI2 clock source -----------------------------------------------*/
  PeriphClkInit->Sai2ClockSelection         = __HAL_RCC_GET_SAI2_SOURCE();
  /* Get the SDMMC1 clock source ---------------------------------------------*/
  PeriphClkInit->Sdmmc1ClockSelection       = __HAL_RCC_GET_SDMMC1_SOURCE();
  /* Get the SDMMC2 clock source ---------------------------------------------*/
  PeriphClkInit->Sdmmc2ClockSelection       = __HAL_RCC_GET_SDMMC2_SOURCE();
  /* Get the SPDIFRX1 clock source -------------------------------------------*/
  PeriphClkInit->Spdifrx1ClockSelection     = __HAL_RCC_GET_SPDIFRX1_SOURCE();
  /* Get the SPI1 clock source -----------------------------------------------*/
  PeriphClkInit->Spi1ClockSelection         = __HAL_RCC_GET_SPI1_SOURCE();
  /* Get the SPI2 clock source -----------------------------------------------*/
  PeriphClkInit->Spi2ClockSelection         = __HAL_RCC_GET_SPI2_SOURCE();
  /* Get the SPI3 clock source -----------------------------------------------*/
  PeriphClkInit->Spi3ClockSelection         = __HAL_RCC_GET_SPI3_SOURCE();
  /* Get the SPI4 clock source -----------------------------------------------*/
  PeriphClkInit->Spi4ClockSelection         = __HAL_RCC_GET_SPI4_SOURCE();
  /* Get the SPI5 clock source -----------------------------------------------*/
  PeriphClkInit->Spi5ClockSelection         = __HAL_RCC_GET_SPI5_SOURCE();
  /* Get the SPI6 clock source -----------------------------------------------*/
  PeriphClkInit->Spi6ClockSelection         = __HAL_RCC_GET_SPI6_SOURCE();
  /* Get the TIM Prescaler configuration -------------------------------------*/
  PeriphClkInit->TIMPresSelection           = __HAL_RCC_GET_TIMCLKPRESCALER();
  /* Get the USART1 clock source ---------------------------------------------*/
  PeriphClkInit->Usart1ClockSelection       = __HAL_RCC_GET_USART1_SOURCE();
  /* Get the USART2 clock source ---------------------------------------------*/
  PeriphClkInit->Usart2ClockSelection       = __HAL_RCC_GET_USART2_SOURCE();
  /* Get the USART3 clock source ---------------------------------------------*/
  PeriphClkInit->Usart3ClockSelection       = __HAL_RCC_GET_USART3_SOURCE();
  /* Get the UART4 clock source ----------------------------------------------*/
  PeriphClkInit->Uart4ClockSelection        = __HAL_RCC_GET_UART4_SOURCE();
  /* Get the UART5 clock source ----------------------------------------------*/
  PeriphClkInit->Uart5ClockSelection        = __HAL_RCC_GET_UART5_SOURCE();
  /* Get the USART6 clock source ---------------------------------------------*/
  PeriphClkInit->Usart6ClockSelection       = __HAL_RCC_GET_USART6_SOURCE();
  /* Get the UART7 clock source ----------------------------------------------*/
  PeriphClkInit->Uart7ClockSelection        = __HAL_RCC_GET_UART7_SOURCE();
  /* Get the UART8 clock source ----------------------------------------------*/
  PeriphClkInit->Uart8ClockSelection        = __HAL_RCC_GET_UART8_SOURCE();
  /* Get the UART9 clock source ----------------------------------------------*/
  PeriphClkInit->Uart9ClockSelection        = __HAL_RCC_GET_UART9_SOURCE();
  /* Get the USART10 clock source --------------------------------------------*/
  PeriphClkInit->Usart10ClockSelection      = __HAL_RCC_GET_USART10_SOURCE();
  /* Get the USBPHY1 clock source --------------------------------------------*/
  PeriphClkInit->UsbPhy1ClockSelection      = __HAL_RCC_GET_USBPHY1_SOURCE();
  /* Get the USB OTGHS1 clock source -----------------------------------------*/
  PeriphClkInit->UsbOtgHs1ClockSelection    = __HAL_RCC_GET_USBOTGHS1_SOURCE();
  /* Get the USBPHY2 clock source --------------------------------------------*/
  PeriphClkInit->UsbPhy2ClockSelection      = __HAL_RCC_GET_USBPHY2_SOURCE();
  /* Get the USB OTGHS2 clock source -----------------------------------------*/
  PeriphClkInit->UsbOtgHs2ClockSelection    = __HAL_RCC_GET_USBOTGHS2_SOURCE();
  /* Get the XSPI1 clock source ----------------------------------------------*/
  PeriphClkInit->Xspi1ClockSelection        = __HAL_RCC_GET_XSPI1_SOURCE();
  /* Get the XSPI2 clock source ----------------------------------------------*/
  PeriphClkInit->Xspi2ClockSelection        = __HAL_RCC_GET_XSPI2_SOURCE();
  /* Get the XSPI3 clock source ----------------------------------------------*/
  PeriphClkInit->Xspi3ClockSelection        = __HAL_RCC_GET_XSPI3_SOURCE();
}

/**
  * @brief  Return the peripheral clock frequency for a given peripheral (SAI..)
  * @note   Return 0 if peripheral clock identifier not managed by this API or
  *         if the selected clock source is not enabled (HSI, PLLs clock output..)
  * @param  PeriphClk: Peripheral clock identifier
  *         This parameter can be one of the following values:
  *            @arg RCC_PERIPHCLK_ADC      : ADC peripheral clock
  *            @arg RCC_PERIPHCLK_ADF1     : ADF1 peripheral clock
  *            @arg RCC_PERIPHCLK_CSI      : CSI peripheral clock
  *            @arg RCC_PERIPHCLK_DCMIPP   : DCMIPP peripheral clock
  *            @arg RCC_PERIPHCLK_I2C1     : I2C1 peripheral clock
  *            @arg RCC_PERIPHCLK_I2C2     : I2C2 peripheral clock
  *            @arg RCC_PERIPHCLK_I2C3     : I2C3 peripheral clock
  *            @arg RCC_PERIPHCLK_I2C4     : I2C4 peripheral clock
  *            @arg RCC_PERIPHCLK_I3C1     : I3C1 peripheral clock
  *            @arg RCC_PERIPHCLK_I3C2     : I3C2 peripheral clock
  *            @arg RCC_PERIPHCLK_FDCAN    : FDCAN peripheral clock
  *            @arg RCC_PERIPHCLK_FMC      : FMC peripheral clock
  *            @arg RCC_PERIPHCLK_LPTIM1   : LPTIM1 peripheral clock
  *            @arg RCC_PERIPHCLK_LPTIM2   : LPTIM2 peripheral clock
  *            @arg RCC_PERIPHCLK_LPTIM3   : LPTIM3 peripheral clock
  *            @arg RCC_PERIPHCLK_LPTIM4   : LPTIM4 peripheral clock
  *            @arg RCC_PERIPHCLK_LPTIM5   : LPTIM5 peripheral clock
  *            @arg RCC_PERIPHCLK_LPUART1  : LPUART1 peripheral clock
  *            @arg RCC_PERIPHCLK_LTDC     : LTDC peripheral clock
  *            @arg RCC_PERIPHCLK_MDF1     : MDF1 peripheral clock
  *            @arg RCC_PERIPHCLK_PSSI     : PSSI peripheral clock
  *            @arg RCC_PERIPHCLK_SAI1     : SAI1 peripheral clock
  *            @arg RCC_PERIPHCLK_SAI2     : SAI2 peripheral clock
  *            @arg RCC_PERIPHCLK_SDMMC1   : SDMMC1 peripheral clock
  *            @arg RCC_PERIPHCLK_SDMMC2   : SDMMC2 peripheral clock
  *            @arg RCC_PERIPHCLK_SPDIFRX1 : SPDIFRX1 peripheral clock
  *            @arg RCC_PERIPHCLK_SPI1     : SPI1 peripheral clock
  *            @arg RCC_PERIPHCLK_SPI2     : SPI2 peripheral clock
  *            @arg RCC_PERIPHCLK_SPI3     : SPI3 peripheral clock
  *            @arg RCC_PERIPHCLK_SPI4     : SPI4 peripheral clock
  *            @arg RCC_PERIPHCLK_SPI5     : SPI5 peripheral clock
  *            @arg RCC_PERIPHCLK_SPI6     : SPI6 peripheral clock
  *            @arg RCC_PERIPHCLK_USART1   : USART1 peripheral clock
  *            @arg RCC_PERIPHCLK_USART2   : USART2 peripheral clock
  *            @arg RCC_PERIPHCLK_USART3   : USART3 peripheral clock
  *            @arg RCC_PERIPHCLK_UART4    : UART4 peripheral clock
  *            @arg RCC_PERIPHCLK_UART5    : UART5 peripheral clock
  *            @arg RCC_PERIPHCLK_USART6   : USART6 peripheral clock
  *            @arg RCC_PERIPHCLK_UART7    : UART7 peripheral clock
  *            @arg RCC_PERIPHCLK_UART8    : UART8 peripheral clock
  *            @arg RCC_PERIPHCLK_UART9    : UART9 peripheral clock
  *            @arg RCC_PERIPHCLK_USART10  : USART10 peripheral clock
  *            @arg RCC_PERIPHCLK_XSPI1    : XSPI1 peripheral clock
  *            @arg RCC_PERIPHCLK_XSPI2    : XSPI2 peripheral clock
  *            @arg RCC_PERIPHCLK_XSPI3    : XSPI3 peripheral clock
  * @retval Frequency in KHz
  */
uint32_t HAL_RCCEx_GetPeriphCLKFreq(uint64_t PeriphClk)
{
  uint32_t frequency = 0;   /* Set to 0 for returned value if no source clock */

