micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_rcc_ex.c
  switch (PeriphClk)
  {
    case RCC_PERIPHCLK_ADC:
      frequency = RCCEx_GetADCCLKFreq(LL_RCC_ADC_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_ADF1:
      frequency = RCCEx_GetADFCLKFreq(LL_RCC_ADF1_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_CSI:
      frequency = RCCEx_GetCSICLKFreq();
      break;

    case RCC_PERIPHCLK_CKPER:
      frequency = RCCEx_GetCLKPCLKFreq(LL_RCC_CLKP_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_DCMIPP:
      frequency = RCCEx_GetDCMIPPCLKFreq(LL_RCC_DCMIPP_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_ETH1:
      frequency = RCCEx_GetETH1CLKFreq(LL_RCC_ETH1_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_ETH1PTP:
      frequency = RCCEx_GetETH1PTPCLKFreq(LL_RCC_ETH1PTP_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_FDCAN:
      frequency = RCCEx_GetFDCANCLKFreq(LL_RCC_FDCAN_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_FMC:
      frequency = RCCEx_GetFMCCLKFreq(LL_RCC_FMC_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_I2C1:
      frequency = RCCEx_GetI2CCLKFreq(LL_RCC_I2C1_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_I2C2:
      frequency = RCCEx_GetI2CCLKFreq(LL_RCC_I2C2_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_I2C3:
      frequency = RCCEx_GetI2CCLKFreq(LL_RCC_I2C3_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_I2C4:
      frequency = RCCEx_GetI2CCLKFreq(LL_RCC_I2C4_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_I3C1:
      frequency = RCCEx_GetI3CCLKFreq(LL_RCC_I3C1_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_I3C2:
      frequency = RCCEx_GetI3CCLKFreq(LL_RCC_I3C2_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_LPTIM1:
      frequency = RCCEx_GetLPTIMCLKFreq(LL_RCC_LPTIM1_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_LPTIM2:
      frequency = RCCEx_GetLPTIMCLKFreq(LL_RCC_LPTIM2_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_LPTIM3:
      frequency = RCCEx_GetLPTIMCLKFreq(LL_RCC_LPTIM3_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_LPTIM4:
      frequency = RCCEx_GetLPTIMCLKFreq(LL_RCC_LPTIM4_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_LPTIM5:
      frequency = RCCEx_GetLPTIMCLKFreq(LL_RCC_LPTIM5_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_LPUART1:
      frequency = RCCEx_GetLPUARTCLKFreq(LL_RCC_LPUART1_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_LTDC:
      frequency = RCCEx_GetLTDCCLKFreq(LL_RCC_LTDC_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_MDF1:
      frequency = RCCEx_GetMDFCLKFreq(LL_RCC_MDF1_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_PSSI:
      frequency = RCCEx_GetPSSICLKFreq(LL_RCC_PSSI_CLKSOURCE);
      break;

    case  RCC_PERIPHCLK_RTC:
      frequency = RCCEx_GetRTCCLKFreq();
      break;

    case RCC_PERIPHCLK_SAI1:
      frequency = RCCEx_GetSAICLKFreq(LL_RCC_SAI1_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_SAI2:
      frequency = RCCEx_GetSAICLKFreq(LL_RCC_SAI2_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_SDMMC1:
      frequency = RCCEx_GetSDMMCCLKFreq(LL_RCC_SDMMC1_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_SDMMC2:
      frequency = RCCEx_GetSDMMCCLKFreq(LL_RCC_SDMMC2_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_SPDIFRX1:
      frequency = RCCEx_GetSPDIFRXCLKFreq(LL_RCC_SPDIFRX1_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_SPI1:
      frequency = RCCEx_GetSPICLKFreq(LL_RCC_SPI1_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_SPI2:
      frequency = RCCEx_GetSPICLKFreq(LL_RCC_SPI2_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_SPI3:
      frequency = RCCEx_GetSPICLKFreq(LL_RCC_SPI3_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_SPI4:
      frequency = RCCEx_GetSPICLKFreq(LL_RCC_SPI4_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_SPI5:
      frequency = RCCEx_GetSPICLKFreq(LL_RCC_SPI5_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_SPI6:
      frequency = RCCEx_GetSPICLKFreq(LL_RCC_SPI6_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_USART1:
      frequency = RCCEx_GetUSARTCLKFreq(LL_RCC_USART1_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_USART2:
      frequency = RCCEx_GetUSARTCLKFreq(LL_RCC_USART2_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_USART3:
      frequency = RCCEx_GetUSARTCLKFreq(LL_RCC_USART3_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_UART4:
      frequency = RCCEx_GetUARTCLKFreq(LL_RCC_UART4_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_UART5:
      frequency = RCCEx_GetUARTCLKFreq(LL_RCC_UART5_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_USART6:
      frequency = RCCEx_GetUSARTCLKFreq(LL_RCC_USART6_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_UART7:
      frequency = RCCEx_GetUARTCLKFreq(LL_RCC_UART7_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_UART8:
      frequency = RCCEx_GetUARTCLKFreq(LL_RCC_UART8_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_UART9:
      frequency = RCCEx_GetUARTCLKFreq(LL_RCC_UART9_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_USART10:
      frequency = RCCEx_GetUSARTCLKFreq(LL_RCC_USART10_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_USBPHY1:
      frequency = RCCEx_GetOTGPHYCKREFCLKFreq(LL_RCC_OTGPHY1CKREF_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_USBOTGHS1:
      frequency = RCCEx_GetOTGPHYCLKFreq(LL_RCC_OTGPHY1_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_USBPHY2:
      frequency = RCCEx_GetOTGPHYCKREFCLKFreq(LL_RCC_OTGPHY2CKREF_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_USBOTGHS2:
      frequency = RCCEx_GetOTGPHYCLKFreq(LL_RCC_OTGPHY2_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_XSPI1:
      frequency = RCCEx_GetXSPICLKFreq(LL_RCC_XSPI1_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_XSPI2:
      frequency = RCCEx_GetXSPICLKFreq(LL_RCC_XSPI2_CLKSOURCE);
      break;

    case RCC_PERIPHCLK_XSPI3:
      frequency = RCCEx_GetXSPICLKFreq(LL_RCC_XSPI3_CLKSOURCE);
      break;

    default:
      /* Unexpected case, frequency is by default set to 0 */
      break;
  }

  return frequency;
}

/**
  * @brief  Return PLL1 clock frequency
  * @note   RCC_PERIPH_FREQUENCY_NO returned for non activated output or oscillator not ready
  * @retval PLL1 output clock frequency
  */
uint32_t HAL_RCCEx_GetPLL1CLKFreq(void)
{
  uint32_t plloutputfreq = RCC_PERIPH_FREQUENCY_NO;
  uint32_t divm;

