micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_rcc_ex.c
    case LL_RCC_ADF1_CLKSOURCE_TIMG:
      adf_frequency = HAL_RCC_GetSysClockFreq() / (1UL << LL_RCC_GetTIMPrescaler());
      break;

    default:
      /* Unexpected case */
      break;
  }

  return adf_frequency;
}

/**
  * @brief  Return CLKP clock frequency
  * @param  CLKPxSource This parameter can be one of the following values:
  *         @arg @ref RCCEx_CLKP_Clock_Source
  * @retval CLKP clock frequency (in Hz)
  *         - @ref  RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
static uint32_t RCCEx_GetCLKPCLKFreq(uint32_t CLKPxSource)
{
  uint32_t clkp_frequency = RCC_PERIPH_FREQUENCY_NO;
  uint32_t ic_divider;

  if (LL_RCC_CLKP_IsEnabled() == 1U)
  {
    switch (LL_RCC_GetCLKPClockSource(CLKPxSource))
    {
      case LL_RCC_CLKP_CLKSOURCE_HSI:
        if (LL_RCC_HSI_IsReady() != 0U)
        {
          clkp_frequency = HSI_VALUE >> (LL_RCC_HSI_GetDivider() >> RCC_HSICFGR_HSIDIV_Pos);
        }
        break;

      case LL_RCC_CLKP_CLKSOURCE_MSI:
        if (LL_RCC_MSI_IsReady() != 0U)
        {
          clkp_frequency = MSI_VALUE;
        }
        break;

      case LL_RCC_CLKP_CLKSOURCE_HSE:
        if (LL_RCC_HSE_IsReady() != 0U)
        {
          clkp_frequency = HSE_VALUE;
        }
        break;

      case LL_RCC_CLKP_CLKSOURCE_IC5:
        if (LL_RCC_IC5_IsEnabled() != 0U)
        {
          ic_divider = LL_RCC_IC5_GetDivider();
          switch (LL_RCC_IC5_GetSource())
          {
            case LL_RCC_ICCLKSOURCE_PLL1:
              clkp_frequency = HAL_RCCEx_GetPLL1CLKFreq();
              clkp_frequency = clkp_frequency / ic_divider;
              break;
            case LL_RCC_ICCLKSOURCE_PLL2:
              clkp_frequency = HAL_RCCEx_GetPLL2CLKFreq();
              clkp_frequency = clkp_frequency / ic_divider;
              break;
            case LL_RCC_ICCLKSOURCE_PLL3:
              clkp_frequency = HAL_RCCEx_GetPLL3CLKFreq();
              clkp_frequency = clkp_frequency / ic_divider;
              break;
            case LL_RCC_ICCLKSOURCE_PLL4:
              clkp_frequency = HAL_RCCEx_GetPLL4CLKFreq();
              clkp_frequency = clkp_frequency / ic_divider;
              break;
            default:
              /* Unexpected case */
              break;
          }
        }
        break;

      case LL_RCC_CLKP_CLKSOURCE_IC10:
        if (LL_RCC_IC10_IsEnabled() != 0U)
        {
          ic_divider = LL_RCC_IC10_GetDivider();
          switch (LL_RCC_IC10_GetSource())
          {
            case LL_RCC_ICCLKSOURCE_PLL1:
              clkp_frequency = HAL_RCCEx_GetPLL1CLKFreq();
              clkp_frequency = clkp_frequency / ic_divider;
              break;
            case LL_RCC_ICCLKSOURCE_PLL2:
              clkp_frequency = HAL_RCCEx_GetPLL2CLKFreq();
              clkp_frequency = clkp_frequency / ic_divider;
              break;
            case LL_RCC_ICCLKSOURCE_PLL3:
              clkp_frequency = HAL_RCCEx_GetPLL3CLKFreq();
              clkp_frequency = clkp_frequency / ic_divider;
              break;
            case LL_RCC_ICCLKSOURCE_PLL4:
              clkp_frequency = HAL_RCCEx_GetPLL4CLKFreq();
              clkp_frequency = clkp_frequency / ic_divider;
              break;
            default:
              /* Unexpected case */
              break;
          }
        }
        break;

      case LL_RCC_CLKP_CLKSOURCE_IC15:
        if (LL_RCC_IC15_IsEnabled() != 0U)
        {
          ic_divider = LL_RCC_IC15_GetDivider();
          switch (LL_RCC_IC15_GetSource())
          {
            case LL_RCC_ICCLKSOURCE_PLL1:
              clkp_frequency = HAL_RCCEx_GetPLL1CLKFreq();
              clkp_frequency = clkp_frequency / ic_divider;
              break;
            case LL_RCC_ICCLKSOURCE_PLL2:
              clkp_frequency = HAL_RCCEx_GetPLL2CLKFreq();
              clkp_frequency = clkp_frequency / ic_divider;
              break;
            case LL_RCC_ICCLKSOURCE_PLL3:
              clkp_frequency = HAL_RCCEx_GetPLL3CLKFreq();
              clkp_frequency = clkp_frequency / ic_divider;
              break;
            case LL_RCC_ICCLKSOURCE_PLL4:
              clkp_frequency = HAL_RCCEx_GetPLL4CLKFreq();
              clkp_frequency = clkp_frequency / ic_divider;
              break;
            default:
              /* Unexpected case */
              break;
          }
        }
        break;

      case LL_RCC_CLKP_CLKSOURCE_IC19:
        if (LL_RCC_IC19_IsEnabled() != 0U)
        {
          ic_divider = LL_RCC_IC19_GetDivider();
          switch (LL_RCC_IC19_GetSource())
          {
            case LL_RCC_ICCLKSOURCE_PLL1:
              clkp_frequency = HAL_RCCEx_GetPLL1CLKFreq();
              clkp_frequency = clkp_frequency / ic_divider;
              break;
            case LL_RCC_ICCLKSOURCE_PLL2:
              clkp_frequency = HAL_RCCEx_GetPLL2CLKFreq();
              clkp_frequency = clkp_frequency / ic_divider;
              break;
            case LL_RCC_ICCLKSOURCE_PLL3:
              clkp_frequency = HAL_RCCEx_GetPLL3CLKFreq();
              clkp_frequency = clkp_frequency / ic_divider;
              break;
            case LL_RCC_ICCLKSOURCE_PLL4:
              clkp_frequency = HAL_RCCEx_GetPLL4CLKFreq();
              clkp_frequency = clkp_frequency / ic_divider;
              break;
            default:
              /* Unexpected case */
              break;
          }
        }
        break;

      case LL_RCC_CLKP_CLKSOURCE_IC20:
        if (LL_RCC_IC20_IsEnabled() != 0U)
        {
          ic_divider = LL_RCC_IC20_GetDivider();
          switch (LL_RCC_IC20_GetSource())
          {
            case LL_RCC_ICCLKSOURCE_PLL1:
              clkp_frequency = HAL_RCCEx_GetPLL1CLKFreq();
              clkp_frequency = clkp_frequency / ic_divider;
              break;
            case LL_RCC_ICCLKSOURCE_PLL2:
              clkp_frequency = HAL_RCCEx_GetPLL2CLKFreq();
              clkp_frequency = clkp_frequency / ic_divider;
              break;
            case LL_RCC_ICCLKSOURCE_PLL3:
              clkp_frequency = HAL_RCCEx_GetPLL3CLKFreq();
              clkp_frequency = clkp_frequency / ic_divider;
              break;
            case LL_RCC_ICCLKSOURCE_PLL4:
              clkp_frequency = HAL_RCCEx_GetPLL4CLKFreq();
              clkp_frequency = clkp_frequency / ic_divider;
              break;
            default:
              /* Unexpected case */
              break;
          }
        }
        break;

      default:
        /* Unexpected case */
        break;
    }
  }

  return clkp_frequency;
}

/**
  * @brief  Return CSI clock frequency
  * @retval CLKP clock frequency (in Hz)
  *         - @ref  RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
static uint32_t RCCEx_GetCSICLKFreq(void)
{
  uint32_t clkp_frequency = RCC_PERIPH_FREQUENCY_NO;

  if (LL_RCC_IC18_IsEnabled() != 0U)
  {
    uint32_t ic_divider = LL_RCC_IC18_GetDivider();
    switch (LL_RCC_IC18_GetSource())
    {
      case LL_RCC_ICCLKSOURCE_PLL1:
        clkp_frequency = HAL_RCCEx_GetPLL1CLKFreq();
        clkp_frequency = clkp_frequency / ic_divider;
        break;
      case LL_RCC_ICCLKSOURCE_PLL2:
        clkp_frequency = HAL_RCCEx_GetPLL2CLKFreq();
        clkp_frequency = clkp_frequency / ic_divider;
        break;
      case LL_RCC_ICCLKSOURCE_PLL3:
        clkp_frequency = HAL_RCCEx_GetPLL3CLKFreq();
        clkp_frequency = clkp_frequency / ic_divider;
        break;
      case LL_RCC_ICCLKSOURCE_PLL4:
        clkp_frequency = HAL_RCCEx_GetPLL4CLKFreq();
        clkp_frequency = clkp_frequency / ic_divider;
        break;
      default:
        /* Unexpected case */
        break;
    }
  }

  return clkp_frequency;
}

/**
  * @brief  Return DCMIPP clock frequency
  * @param  DCMIPPxSource This parameter can be one of the following values:
  *         @arg @ref RCCEx_DCMIPP_Clock_Source
  * @retval DCMIPP clock frequency (in Hz)
  *         - @ref  RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
static uint32_t RCCEx_GetDCMIPPCLKFreq(uint32_t DCMIPPxSource)
{
  uint32_t dcmipp_frequency = RCC_PERIPH_FREQUENCY_NO;
  uint32_t ic_divider;

  switch (LL_RCC_GetDCMIPPClockSource(DCMIPPxSource))
  {
    case LL_RCC_DCMIPP_CLKSOURCE_PCLK5:
      dcmipp_frequency = RCCEx_GetPCLK5Freq(RCCEx_GetHCLKFreq(HAL_RCC_GetSysClockFreq()));
      break;

    case LL_RCC_DCMIPP_CLKSOURCE_CLKP:
      dcmipp_frequency = RCCEx_GetCLKPCLKFreq(LL_RCC_CLKP_CLKSOURCE);
      break;

    case LL_RCC_DCMIPP_CLKSOURCE_IC17:
      if (LL_RCC_IC17_IsEnabled() != 0U)
      {
        ic_divider = LL_RCC_IC17_GetDivider();
        switch (LL_RCC_IC17_GetSource())
        {
          case LL_RCC_ICCLKSOURCE_PLL1:
            dcmipp_frequency = HAL_RCCEx_GetPLL1CLKFreq();
            dcmipp_frequency = dcmipp_frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL2:
            dcmipp_frequency = HAL_RCCEx_GetPLL2CLKFreq();
            dcmipp_frequency = dcmipp_frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL3:
            dcmipp_frequency = HAL_RCCEx_GetPLL3CLKFreq();
            dcmipp_frequency = dcmipp_frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL4:
            dcmipp_frequency = HAL_RCCEx_GetPLL4CLKFreq();
            dcmipp_frequency = dcmipp_frequency / ic_divider;
            break;
          default:
            /* Unexpected case */
            break;
        }
      }
      break;

    case LL_RCC_DCMIPP_CLKSOURCE_HSI:
      if (LL_RCC_HSI_IsReady() != 0U)
      {
        dcmipp_frequency = HSI_VALUE >> (LL_RCC_HSI_GetDivider() >> RCC_HSICFGR_HSIDIV_Pos);
      }
      break;

    default:
      /* Unexpected case */
      break;
  }

