micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_rcc_ex.c
  return dcmipp_frequency;
}

/**
  * @brief  Return ETH1 clock frequency
  * @param  ETH1xSource This parameter can be one of the following values:
  *         @arg @ref RCCEx_ETH1_Clock_Source
  * @retval ETH1 clock frequency (in Hz)
  *         - @ref  RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
static uint32_t RCCEx_GetETH1CLKFreq(uint32_t ETH1xSource)
{
  uint32_t eth1_frequency = RCC_PERIPH_FREQUENCY_NO;
  uint32_t ic_divider;

  switch (LL_RCC_GetETHClockSource(ETH1xSource))
  {
    case LL_RCC_ETH1_CLKSOURCE_HCLK:
      eth1_frequency = RCCEx_GetHCLKFreq(HAL_RCC_GetSysClockFreq());
      break;

    case LL_RCC_ETH1_CLKSOURCE_CLKP:
      eth1_frequency = RCCEx_GetCLKPCLKFreq(LL_RCC_CLKP_CLKSOURCE);
      break;

    case LL_RCC_ETH1_CLKSOURCE_IC12:
      if (LL_RCC_IC12_IsEnabled() != 0U)
      {
        ic_divider = LL_RCC_IC12_GetDivider();
        switch (LL_RCC_IC12_GetSource())
        {
          case LL_RCC_ICCLKSOURCE_PLL1:
            eth1_frequency = HAL_RCCEx_GetPLL1CLKFreq();
            eth1_frequency = eth1_frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL2:
            eth1_frequency = HAL_RCCEx_GetPLL2CLKFreq();
            eth1_frequency = eth1_frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL3:
            eth1_frequency = HAL_RCCEx_GetPLL3CLKFreq();
            eth1_frequency = eth1_frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL4:
            eth1_frequency = HAL_RCCEx_GetPLL4CLKFreq();
            eth1_frequency = eth1_frequency / ic_divider;
            break;
          default:
            /* Unexpected case */
            break;
        }
      }
      break;

    case LL_RCC_ETH1_CLKSOURCE_HSE:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        eth1_frequency = HSE_VALUE;
      }
      break;

    default:
      /* Unexpected case */
      break;
  }

  return eth1_frequency;
}

/**
  * @brief  Return ETH1PTP clock frequency
  * @param  ETH1PTPxSource This parameter can be one of the following values:
  *         @arg @ref RCCEx_ETH1_PTP_Clock_Source
  * @retval ETH1PTP clock frequency (in Hz)
  *         - @ref  RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
static uint32_t RCCEx_GetETH1PTPCLKFreq(uint32_t ETH1PTPxSource)
{
  uint32_t eth1ptp_frequency = RCC_PERIPH_FREQUENCY_NO;
  uint32_t ic_divider;

  switch (LL_RCC_GetETHPTPClockSource(ETH1PTPxSource))
  {
    case LL_RCC_ETH1PTP_CLKSOURCE_HCLK:
      eth1ptp_frequency = RCCEx_GetHCLKFreq(HAL_RCC_GetSysClockFreq());
      break;

    case LL_RCC_ETH1PTP_CLKSOURCE_CLKP:
      eth1ptp_frequency = RCCEx_GetCLKPCLKFreq(LL_RCC_CLKP_CLKSOURCE);
      break;

    case LL_RCC_ETH1PTP_CLKSOURCE_IC13:
      if (LL_RCC_IC13_IsEnabled() != 0U)
      {
        ic_divider = LL_RCC_IC13_GetDivider();
        switch (LL_RCC_IC13_GetSource())
        {
          case LL_RCC_ICCLKSOURCE_PLL1:
            eth1ptp_frequency = HAL_RCCEx_GetPLL1CLKFreq();
            eth1ptp_frequency = eth1ptp_frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL2:
            eth1ptp_frequency = HAL_RCCEx_GetPLL2CLKFreq();
            eth1ptp_frequency = eth1ptp_frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL3:
            eth1ptp_frequency = HAL_RCCEx_GetPLL3CLKFreq();
            eth1ptp_frequency = eth1ptp_frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL4:
            eth1ptp_frequency = HAL_RCCEx_GetPLL4CLKFreq();
            eth1ptp_frequency = eth1ptp_frequency / ic_divider;
            break;
          default:
            /* Unexpected case */
            break;
        }
      }
      break;

    case LL_RCC_ETH1PTP_CLKSOURCE_HSE:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        eth1ptp_frequency = HSE_VALUE;
      }
      break;

    default:
      /* Unexpected case */
      break;
  }

  return (eth1ptp_frequency / __HAL_RCC_GET_ETH1PTP_DIVIDER());
}

/**
  * @brief  Return FDCAN clock frequency
  * @param  FDCANxSource This parameter can be one of the following values:
  *         @arg @ref RCCEx_FDCAN_Clock_Source
  * @retval FDCAN clock frequency (in Hz)
  *         - @ref  RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
static uint32_t RCCEx_GetFDCANCLKFreq(uint32_t FDCANxSource)
{
  uint32_t fdcan_frequency = RCC_PERIPH_FREQUENCY_NO;
  uint32_t ic_divider;

  switch (LL_RCC_GetFDCANClockSource(FDCANxSource))
  {
    case LL_RCC_FDCAN_CLKSOURCE_PCLK1:
      fdcan_frequency = RCCEx_GetPCLK1Freq(RCCEx_GetHCLKFreq(HAL_RCC_GetSysClockFreq()));
      break;

    case LL_RCC_FDCAN_CLKSOURCE_CLKP:
      fdcan_frequency = RCCEx_GetCLKPCLKFreq(LL_RCC_CLKP_CLKSOURCE);
      break;

    case LL_RCC_FDCAN_CLKSOURCE_IC19:
      if (LL_RCC_IC19_IsEnabled() != 0U)
      {
        ic_divider = LL_RCC_IC19_GetDivider();
        switch (LL_RCC_IC19_GetSource())
        {
          case LL_RCC_ICCLKSOURCE_PLL1:
            fdcan_frequency = HAL_RCCEx_GetPLL1CLKFreq();
            fdcan_frequency = fdcan_frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL2:
            fdcan_frequency = HAL_RCCEx_GetPLL2CLKFreq();
            fdcan_frequency = fdcan_frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL3:
            fdcan_frequency = HAL_RCCEx_GetPLL3CLKFreq();
            fdcan_frequency = fdcan_frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL4:
            fdcan_frequency = HAL_RCCEx_GetPLL4CLKFreq();
            fdcan_frequency = fdcan_frequency / ic_divider;
            break;
          default:
            /* Unexpected case */
            break;
        }
      }
      break;

    case LL_RCC_FDCAN_CLKSOURCE_HSE:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        fdcan_frequency = HSE_VALUE;
      }
      break;

    default:
      /* Unexpected case */
      break;
  }

  return fdcan_frequency;
}

/**
  * @brief  Return FMC clock frequency
  * @param  FMCxSource This parameter can be one of the following values:
  *         @arg @ref RCCEx_FMC_Clock_Source
  * @retval FMC clock frequency (in Hz)
  *         - @ref  RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
static uint32_t RCCEx_GetFMCCLKFreq(uint32_t FMCxSource)
{
  uint32_t fmc_frequency = RCC_PERIPH_FREQUENCY_NO;
  uint32_t ic_divider;

  switch (LL_RCC_GetFMCClockSource(FMCxSource))
  {
    case LL_RCC_FMC_CLKSOURCE_HCLK:
      fmc_frequency = RCCEx_GetHCLKFreq(HAL_RCC_GetSysClockFreq());
      break;

    case LL_RCC_FMC_CLKSOURCE_CLKP:
      fmc_frequency = RCCEx_GetCLKPCLKFreq(LL_RCC_CLKP_CLKSOURCE);
      break;

    case LL_RCC_FMC_CLKSOURCE_IC3:
      if (LL_RCC_IC3_IsEnabled() != 0U)
      {
        ic_divider = LL_RCC_IC3_GetDivider();
        switch (LL_RCC_IC3_GetSource())
        {
          case LL_RCC_ICCLKSOURCE_PLL1:
            fmc_frequency = HAL_RCCEx_GetPLL1CLKFreq();
            fmc_frequency = fmc_frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL2:
            fmc_frequency = HAL_RCCEx_GetPLL2CLKFreq();
            fmc_frequency = fmc_frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL3:
            fmc_frequency = HAL_RCCEx_GetPLL3CLKFreq();
            fmc_frequency = fmc_frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL4:
            fmc_frequency = HAL_RCCEx_GetPLL4CLKFreq();
            fmc_frequency = fmc_frequency / ic_divider;
            break;
          default:
            /* Unexpected case */
            break;
        }
      }
      break;

