micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_rcc_ex.c
static uint32_t RCCEx_GetXSPICLKFreq(uint32_t XSPIxSource)
{
  uint32_t xspi_frequency = RCC_PERIPH_FREQUENCY_NO;
  uint32_t ic_divider;

  switch (LL_RCC_GetXSPIClockSource(XSPIxSource))
  {
    case LL_RCC_XSPI1_CLKSOURCE_HCLK:
    case LL_RCC_XSPI2_CLKSOURCE_HCLK:
    case LL_RCC_XSPI3_CLKSOURCE_HCLK:
      xspi_frequency = RCCEx_GetHCLKFreq(HAL_RCC_GetSysClockFreq());
      break;

    case LL_RCC_XSPI1_CLKSOURCE_CLKP:
    case LL_RCC_XSPI2_CLKSOURCE_CLKP:
    case LL_RCC_XSPI3_CLKSOURCE_CLKP:
      xspi_frequency = RCCEx_GetCLKPCLKFreq(LL_RCC_CLKP_CLKSOURCE);
      break;

    case LL_RCC_XSPI1_CLKSOURCE_IC3:
    case LL_RCC_XSPI2_CLKSOURCE_IC3:
    case LL_RCC_XSPI3_CLKSOURCE_IC3:
      if (LL_RCC_IC3_IsEnabled() != 0U)
      {
        ic_divider = LL_RCC_IC3_GetDivider();
        switch (LL_RCC_IC3_GetSource())
        {
          case LL_RCC_ICCLKSOURCE_PLL1:
            xspi_frequency = HAL_RCCEx_GetPLL1CLKFreq();
            xspi_frequency = xspi_frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL2:
            xspi_frequency = HAL_RCCEx_GetPLL2CLKFreq();
            xspi_frequency = xspi_frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL3:
            xspi_frequency = HAL_RCCEx_GetPLL3CLKFreq();
            xspi_frequency = xspi_frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL4:
            xspi_frequency = HAL_RCCEx_GetPLL4CLKFreq();
            xspi_frequency = xspi_frequency / ic_divider;
            break;
          default:
            /* Unexpected case */
            break;
        }
      }
      break;

    case LL_RCC_XSPI1_CLKSOURCE_IC4:
    case LL_RCC_XSPI2_CLKSOURCE_IC4:
    case LL_RCC_XSPI3_CLKSOURCE_IC4:
      if (LL_RCC_IC4_IsEnabled() != 0U)
      {
        ic_divider = LL_RCC_IC4_GetDivider();
        switch (LL_RCC_IC4_GetSource())
        {
          case LL_RCC_ICCLKSOURCE_PLL1:
            xspi_frequency = HAL_RCCEx_GetPLL1CLKFreq();
            xspi_frequency = xspi_frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL2:
            xspi_frequency = HAL_RCCEx_GetPLL2CLKFreq();
            xspi_frequency = xspi_frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL3:
            xspi_frequency = HAL_RCCEx_GetPLL3CLKFreq();
            xspi_frequency = xspi_frequency / ic_divider;
            break;
          case LL_RCC_ICCLKSOURCE_PLL4:
            xspi_frequency = HAL_RCCEx_GetPLL4CLKFreq();
            xspi_frequency = xspi_frequency / ic_divider;
            break;
          default:
            /* Unexpected case */
            break;
        }
      }
      break;

    default:
      /* Nothing to do */
      break;
  }

  return xspi_frequency;
}

/**
  * @}
  */

#endif /* HAL_RCC_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */
